app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("created_at", "updated_at", "title", "room_number") VALUES (?, ?, ?, ?)  [["created_at", "2021-01-13 22:58:27.859782"], ["updated_at", "2021-01-13 22:58:27.859782"], ["title", "Fake Class "], ["room_number", 12]]
---
  def create
    @school_class = SchoolClass.create(school_classes_params(:title, :room_number))