app/controllers/students_controller.rb

  def update
    if @student.update(student_params(:first_name, :last_name))
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "red"], ["updated_at", "2021-01-13 22:52:19.838032"], ["id", 4]]